SIMISA@@@@@@@@@@JINX0D0t______

Wagon ( 69003T-K

Type ( Engine )
	WagonShape ( 69003_J72_d.s )
	
	Size  ( 2.42033m 3.65672m 8.743m )
Mass ( 38.6t-uk )

Comment( ********* Coupler Information ****************             Included in this section - Type, Spring, Velocity, etc )

	Coupling (
         Type ( Chain )
              	Spring (
			Break ( 600kN 1000kN )
               	r0 ( 10cm 40cm )
              )
          CouplingHasRigidConnection (1)
     )  

Comment( ********** Brakes, Type, Force, etc ***************        Included in this section - Type, Force, Reservoir, Applicatiion, Release. etc )

BrakeSystemType ( "Vacuum_single_pipe" )
MaxBrakeForce ( 106kN ) Comment(55% MT Weight*Cof 0.5)
MaxHandbrakeForce ( 39kN ) Comment(20% MTW*0.5)
BrakeCylinderPressureForMaxBrakeBrakeForce ( 21inHg ) 

Comment (* Cast Iron Brakeshoes *)
ORTSBrakeShoeFriction ( 0.0 0.50 8.0 0.288 16.1 0.241 24.1 0.211 32.2 0.187 40.2 0.173 48.3 0.161 56.3 0.150 64.4 0.142 72.2 0.139 80.5 0.134 88.5 0.129 96.6 0.125 104.6 0.123 112.7 0.121)

Comment( ******* Curve Resistance & SuperElevation *********                  Included in this section - Wheelbase, gauge, etc )

CentreOfGravity ( 0m 1.2m -0.1m )
ORTSTrackGauge ( 4ft 8.5in )
ORTSUnbalancedSuperelevation ( 6in )
ORTSRigidWheelbase ( 13ft 8in  )

Comment( ***************** Friction*************************                   Included in this section - Friction, Bearing Type )

ORTSBearingType ( Friction )
Comment(CN 1990 DW x18)
ORTSDavis_A ( 3990 )
ORTSDavis_B ( 12.91 )
ORTSDavis_C ( 4.274 )

ORTSWagonFrontalArea (80ft^2)
ORTSDavisDragConstant (0.0024)

Comments(  ******* Lights Section *******  Included in this section - Type, Colour, Location, Size, Control, etc)

	Lights	( 6
		Light	(
			comment( Flickering firebox )
			Type		( 0 )
			Conditions	(
				Headlight ( 0 )
				Unit ( 0 )
				)
			FadeIn	( 0.5 )
			FadeOut	( 0.5 )
			Cycle	( 0 )
			States	(	2
				State	(
					Duration ( 0.05 )
					LightColour ( 80ff7200 )
					Position ( 0 1.7 -2.02 )
					Azimuth ( -180 -180 -180 )
					Transition ( 0 )
					Radius ( 1.4 )
					)
				State	(
					Duration ( 0.05 )
					LightColour ( 80ffe610 )
					Position ( 0 1.7 -2.02 )
					Azimuth ( -180 -180 -180 )
					Transition ( 0 )
					Radius ( 1.4 )
					)
				)
			)
		Light	(
			comment( Flickering Lamp Front Position D )
			Type		( 0 )
			Conditions	(
				Headlight ( 4 )
				Unit ( 2 )
				)
			FadeIn	( 0.5 )
			FadeOut	( 0.5 )
			Cycle	( 0 )
			States	(	2
				State	(
					Duration ( 0.05 )
					LightColour ( ffffffff )
					Position ( -0.955 1.41 3.935 )
					Azimuth ( 0 0 0 )
					Transition ( 0 )
					Radius ( 0.4 )
					)
				State	(
					Duration ( 0.05 )
					LightColour ( aaaaffc0 )
					Position ( -0.955 1.41 3.935 )
					Azimuth ( 0 0 0 )
					Transition ( 0 )
					Radius ( 0.4 )
					)
				)
			)
Light	(
			comment( Tender First Front Lamp Position D )
			Type		( 0 )
			Conditions	(
				Headlight ( 4 )
				Unit ( 4 )
				)
			FadeIn	( 0.5 )
			FadeOut	( 0.5 )
			Cycle	( 0 )
			States	(	2
				State	(
					Duration ( 0.05 )
					LightColour ( ffff0000 )
					Position ( -0.955 1.41 3.935 )
					Azimuth ( 0 0 0 )
					Transition ( 0 )
					Radius ( 0.4 )
					)
				State	(
					Duration ( 0.05 )
					LightColour ( aa990000 )
					Position ( -0.955 1.41 3.935 )
					Azimuth ( 0 0 0 )
					Transition ( 0 )
					Radius ( 0.4 )
					)
				)
			)

Light	(
			comment( Flickering Rear Lamp Position D )
			Type		( 0 )
			Conditions	(
				Headlight ( 4 )
				Unit ( 3 )
				)
			FadeIn	( 0.5 )
			FadeOut	( 0.5 )
			Cycle	( 0 )
			States	(	2
				State	(
					Duration ( 0.05 )
					LightColour ( ffff0000 )
					Position ( 0.93 1.458 -4.252 )
					Azimuth ( -180 -180 -180 )
					Transition ( 0 )
					Radius ( 0.4 )
					)
				State	(
					Duration ( 0.05 )
					LightColour ( aa990000 )
					Position ( 0.93 1.458 -4.252 )
					Azimuth ( -180 -180 -180 )
					Transition ( 0 )
					Radius ( 0.4 )
					)
				)
			)

		Light	(
			comment( Tender First Rear Lamp Position D )
			Type		( 0 )
			Conditions	(
				Headlight ( 4 )
				Unit ( 5 )
				)
			FadeIn	( 0.5 )
			FadeOut	( 0.5 )
			Cycle	( 0 )
			States	(	2
				State	(
					Duration ( 0.05 )
					LightColour ( ffffffff )
					Position ( 0.93 1.458 -4.252 )
					Azimuth ( -180 -180 -180 )
					Transition ( 0 )
					Radius ( 0.4 )
					)
				State	(
					Duration ( 0.05 )
					LightColour ( aaaaffc0 )
					Position ( 0.93 1.458 -4.252 )
					Azimuth ( -180 -180 -180 )
					Transition ( 0 )
					Radius ( 0.4 )
					)
				)
			)

		Light	(
			comment( Flickering grate )
			Type		( 0 )
			Conditions	(
				Headlight ( 0 )
				Unit ( 0 )
				)
			FadeIn	( 0.5 )
			FadeOut	( 0.5 )
			Cycle	( 0 )
			States	(	2
				State	(
					Duration ( 0.05 )
					LightColour ( 80ff7200 )
					Position ( 0 0.85 -2.02 )
					Azimuth ( -180 -180 -180 )
					Transition ( 0 )
					Radius ( 1.4 )
					)
				State	(
					Duration ( 0.05 )
					LightColour ( 80ffe610 )
					Position ( 0 0.85 -2.02 )
					Azimuth ( -180 -180 -180 )
					Transition ( 0 )
					Radius ( 1.4 )
					)
				)
			)
		) 

Comment( ******* Miscellaneous Wagon Information************                 Included in this section - Passenger View, Sounds, Freight Animations Intake Points for Tank Engine )

Comment ( ==Passenger View== )
	Inside (
        PassengerCabinFile ( 69003_J72_d.s )
        PassengerCabinHeadPos ( 1.455 2.95 -2 )
        RotationLimit ( 90 180 160 )
        StartDirection ( 0 0 0 )
  	)

	  IntakePoint ( -3.7 2 FuelCoal )
	  IntakePoint ( 1.75 2 FuelWater )
    
Sound ( "..\\..\\common.MEP\\2CylinderSound\\J72eng.sms" )
)



Engine ( 69003T-K
    
Effects
	(
		SteamSpecialEffects
		(
			comment
			(
				the format of these little blocks is as follow:

				offset.x offset.y offset.z
				normal.x normal.y normal.z
				width in metres

				defining the offset from the shape pivot point
				where steam / smoke should appear, the direction
				it should go and the width of the nozzle
			)

			WhistleFX
			(
				0.0 2.9 -1.7
				0 1 0.5
				0.045
			)

			SafetyValvesFX
			(
				0 2.9   -1.1
				0 1 0
				0.2
			)

			StackFX
			(
				0 3.9 2.65
				0 1 0
				0.28
			)

			Injectors2FX
			(
				1.22 0.5 -3
				0 -1 -1
				0.15
			)
			Injectors1FX
			(
				1.22 0.5 -3
				0 -1 -1
				0.15
			)

			CylindersFX
			(
				-0.4 0.6 3
				0 0 1
				0.2
			)

			CylindersFX
			(
				0.4 0.6 3
				0 0 1
				0.2
			)
		)
	)

Wagon ( 63029T-K )
Comment ( *************General Information******************                    Included in this section - Wheels, sanding, etc )

ORTSSteamLocomotiveType ( Simple )
Type ( Steam )
WheelRadius ( 24.625in )
NumWheels ( 3 )
ORTSDriveWheelWeight ( 38.6t-uk  )  
Sanding ( 25mph )

Comment ( ****************** Boiler ************************          Included in this section - Length, volume, heating area, pressure, etc )

ORTSSteamBoilerType ( Saturated )
BoilerVolume ( 97ft^3 ) 
ORTSEvaporationArea ( 731ft^2 )
MaxBoilerPressure ( 140psi )

Comment ( ***************** Cylinders **********************         Included in this section - Number, Stroke, Diameter, steam usage, etc )

NumCylinders ( 2 )
CylinderStroke ( 24in ) 
CylinderDiameter ( 17in ) 
ORTSCylinderEfficiencyRate ( 1.0 )  Comment ( Default Setting)

Comment ( ******************* Fire *************************          Included in this section - Fuel Quality, Grate Area, Shoveling Rate, etc ) 

ORTSFuelCalorific ( 12390btu/lb ) Comment(Blidworth Coal)
ORTSGrateArea ( 11.3ft^2 )
SteamFiremanMaxPossibleFiringRate( 3000 ) 
ShovelCoalMass ( 14lb )    

Comment ( ******************* Fuel *************************
Included in this section - Coal, water, Tender Presence, etc )

MaxTenderCoalMass ( 1t-uk )
MaxTenderWaterMass ( 6900lb )
IsTenderRequired( 0 )	

Comment(       ********ADVANCED PARAMETERS**********      )
Comment( Remove comment statement and outer brackets as required)

Comment(ORTSBoilerEvaporationRate ( 15.0 ))

Comment(ORTSMaxIndicatedHorsepower ( 390.0hp )) 

ORTSCylinderPortOpening ( 0.085 )Comment(0.05 to 0.12)

ORTSBoilerEfficiency( 0.0 0.88  170.0 0.44 ) Comment(Fictional)

Comment(ORTSBurnRate( 0.0 10.0  7875.0 1000.0  12337.0 2000.0  14875.0 2500.0  16275.0 3000.0  18375.0 3500.0 )) 

Comment(ORTSCylinderInitialPressureDrop ( 0.0 0.99 350 0.98 ))

Comment(ORTSCylinderBackPressure ( 0.0 0.0  3000 12.0  ))

Comment ( ***********Gearing (If used) *************************
Included in this section - Gear type, ratio, etc )

Comment ( *****************Brake System ********************        Included in this section - Compressor, Reservoir, Application rates, etc )   

TrainBrakesControllerMinSystemPressure( 0 )
TrainBrakesControllerMaxSystemPressure( 21inHg )
BrakeEquipmentType ( "Vacuum_brake, Handbrake " )
BrakeSystemType ( "Vacuum_single_pipe" )

Comment(************Train Control System (if used)**********        
Includes Monitoring of Overspeed, Vigilance, Emergency Braking)

Comment ( ************** Engine Controls ******************** 
Included-Controllers for Regulator, Reverser, Brakes etc) 

EngineControllers (
Regulator ( 0 1 0.0475 0 
            NumNotches( 0 )
    			)
Cutoff    ( -0.75 0.75 0.01 0 
            NumNotches( 0 )		
  		)

Brake_Train ( 0 1 0.1 0.1
NumNotches( 1
Notch( 0 1 TrainBrakesControllerVacuumContinuousServiceStart )
)) 


            Brake_Hand ( 0 1 0.0125 0
                NumNotches ( 0 )
            )
            FireDoor ( 0 1 0.1 0
                NumNotches ( 0 )
            )
            Sanding( 0 1 0 )
            Blower ( 0 1 0.025 0.2
                NumNotches ( 0 )
            )
            HeatingTap ( 0 1 0.025 0
                NumNotches ( 0 )
            )
            Shovel ( 0 1 0.1 0
                NumNotches ( 0 )
            )
            DampersFront ( 0 1 0.1 1
                NumNotches ( 0 )
            )
            DampersBack ( 0 1 0.1 0
                NumNotches ( 0 )
            )
            Injector1Steam ( 0 1 0 )
            Injector2Steam ( 0 1 0 )
            Injector1Water ( 0 1 0.1 0
                NumNotches ( 0 )
            )
            Injector2Water ( 0 1 0.1 0
                NumNotches ( 0 )
            )
            CylinderCocks ( 0 1 1 )
            Whistle ( 0 1 0 )
            Comment(WaterScoop ( 0 1 0 ))
            SmallEjectorOrCompressor( 0 1 1 )
            Headlights( 0 1 0 )
        )

Comment ( ********** Miscellaneous Information *************              Included in this section - Alternate Views, Sounds, Names, Description etc )  

CabView ( J72Black.cvf )
HeadOut ( -1.3 2.95 -2 )
 
Sound ( "..\\..\\common.MEP\\2CylinderSound\\J72cab.sms" )
Name ( "69003 J72 Tank, York Shed, Dirty Class K Light Code" )
Description (
      "The J72 is one of the most remarkable designs of steam locomotives ever; built by three different companies and by five different Locomotive Superintendents.  The original design Was that of William Wordsell for the North Eastern Railway, with 20 units being built between 1898 and 1899.  20 more were built under Sir Vincent Raven from 1914, with another group of ten in 1920 and a further 25 in 1922.  Sir Nigel Gresley had ten more built in 1925 for the LNER, making the total class number 85.  Even after Nationalisation, the versitility of the design meant that even more were built, 28 this time by Peppercorn for British Railways.\n\n"+
	"The duties of the J72 ranged from light goods movements, through to station piloting and passenger services.  All of the Locomotives stayed in service until 1958, when some of the earlier engines were withdrawn, having served 60 years in traffic.\n\n"+
	"'Joem' is the only member of the class to have survived.  The loco is currenly undergoing restoration to running condition at Hopetown, Darlington, before returning to traffic on the North Yorkshire Moors Railway.\n\n"+
	"Physics by Mick Clarke.\n\n"+
	"New 2022 Model by Geoff Rowlands specially for the MidEast Coast Route.\n"
)
)